Documents/ПроверкаКачестваТоваров.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<Document>
		<Properties>
			<Name>ПроверкаКачестваТоваров</Name>
			<BasedOn>
				<xr:Item>Document.ЗаданиеЛаборатории</xr:Item>
			</BasedOn>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccumulationRegister.АК_РассылкиПоставщикамТехнологам</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ГруппыПоказателей</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаПовторнойПроверки</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаПрикрепления</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДобавилПротокол</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДокументОснование</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ЗаданиеЛаборатории</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИмяФайлаОтвета</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИмяФайла</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИмяФайлаОтветаСРасширением</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИмяФайлаСРасширением</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Comment>Любая дополнительная информация</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Лаборатория</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Нарушения</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Номенклатура</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответ</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Производитель</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РассылкаОбОтсутствииОтветаПоставщика</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СделанаРассылка</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Статус</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СтатусыЖурналаПроверкиКачестваТоваров</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Технолог</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипИсследования_Удалить</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ТипИсследованияПоказателейКачества</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ХарактеристикаНоменклатуры</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ХарактеристикиНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПросмотреноПоставщиком</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТребуетОбязательногоОтветаПроизводителя</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>МестоОтбораОбразца</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтруктурныеЕдиницы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаПроизводстваОбразца</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТемператураОбразца</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>3</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЦельИсследования</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ГосударственныеСтандартыИТехническиеУсловия</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РезультатИсследования</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерПротокола</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаПротокола</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Заключение</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>СоставПоказателей</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Показатель</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ПоказателиКачестваПродукции</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НормаОт</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>6</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НормаДо</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>6</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Результат</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>6</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Нарушение</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Маркер</Name>
							<Type>
								<v8:Type>cfg:EnumRef.МаркерыДляАудита</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ПоказателиПроверки</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ПоказательПроверки</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ПоказателиПроверки</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ТипыИсследований</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ТипИсследования</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ТипИсследованияПоказателейКачества</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ОрганолептическиеПоказатели</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Показатель</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ПоказателиКачестваПродукции</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТребованияПоНД</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>1024</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Результат</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>250</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ФизикоХимическиеПоказатели</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Показатель</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ПоказателиКачестваПродукции</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НормативныйДокумент</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ГосударственныеСтандартыИТехническиеУсловия</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТребованияПоНД</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>1024</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Результат</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>50</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Отклонение</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ФайлыПроизводителя</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ДатаДобавления</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>DateTime</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НаименованиеФайла</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>255</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ИмяФайла</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>255</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

Documents/ПроверкаКачестваТоваров/Ext/ManagerModule.bsl
//+++АК SHEP 2018.03.12 ИП-00017032
Функция ПолучитьКаталогХраненияФайлов(Ссылка = Неопределено) Экспорт
	
	УстановитьПривилегированныйРежим(Истина);
	
	КаталогХраненияФайлов = СокрЛП(Константы.КаталогХраненияФайлов.Получить());
	КаталогХраненияФайлов = КаталогХраненияФайлов + ?(Прав(КаталогХраненияФайлов, 1) = "\", "", "\");
	
	ФайлКаталогХраненияФайлов = Новый Файл(КаталогХраненияФайлов);
	Если НЕ ФайлКаталогХраненияФайлов.Существует() Тогда
		СоздатьКаталог(КаталогХраненияФайлов);
	КонецЕсли;
	
	УстановитьПривилегированныйРежим(Ложь);
	
	Возврат КаталогХраненияФайлов;
	
КонецФункции

//+++АК ILIK 2018.07.06 ИП-00018897
Процедура ПечатьПротоколаПроверки(ТабДок, Ссылка) Экспорт
	ТабДок.Очистить();
	
	Макет = Документы.ПроверкаКачестваТоваров.ПолучитьМакет("ПротоколПроверки");
	ОбластьШапка = Макет.ПолучитьОбласть("Шапка");
	ОбластьШапкаОрганолептическиеПоказатели = Макет.ПолучитьОбласть("ШапкаОрганолептическиеПоказатели");
	ОбластьСтрокаОрганолептическиеПоказатели = Макет.ПолучитьОбласть("СтрокаОрганолептическиеПоказатели");
	ОбластьШапкаФизикоХимическиеПоказатели = Макет.ПолучитьОбласть("ШапкаФизикоХимическиеПоказатели");
	ОбластьСтрокаФизикоХимическиеПоказатели = Макет.ПолучитьОбласть("СтрокаФизикоХимическиеПоказатели");
	ОбластьПодвал = Макет.ПолучитьОбласть("Подвал");
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	ПроверкаКачестваТоваров.Дата,
	               |	ПроверкаКачестваТоваров.Лаборатория.НаименованиеПолное КАК Лаборатория,
	               |	ПроверкаКачестваТоваров.Номенклатура.НаименованиеПолное КАК Номенклатура,
	               |	ПроверкаКачестваТоваров.Производитель.НаименованиеПолное КАК Производитель,
	               |	ПроверкаКачестваТоваров.ЦельИсследования,
	               |	ПроверкаКачестваТоваров.РезультатИсследования,
	               |	ПроверкаКачестваТоваров.ХарактеристикаНоменклатуры.СрокГодности КАК СрокГодности,
	               |	ПроверкаКачестваТоваров.ХарактеристикаНоменклатуры.ТипСрокаГодности.Наименование КАК ТипСрокаГодности,
	               |	ВЫБОР
	               |		КОГДА ПроверкаКачестваТоваров.ХарактеристикаНоменклатуры.ТипСрокаГодности = &СрокГодностиГод
	               |			ТОГДА "";%1 год;;%1 года;%1 лет;%1 года""
	               |		КОГДА ПроверкаКачестваТоваров.ХарактеристикаНоменклатуры.ТипСрокаГодности = &СрокГодностиМесяц
	               |			ТОГДА "";%1 месяц;;%1 месяца;%1 месяцев;%1 месяца""
	               |		КОГДА ПроверкаКачестваТоваров.ХарактеристикаНоменклатуры.ТипСрокаГодности = &СрокГодностиСутки
	               |			ТОГДА "";%1 сутки;;%1 суток;%1 суток;%1 суток""
	               |		КОГДА ПроверкаКачестваТоваров.ХарактеристикаНоменклатуры.ТипСрокаГодности = &СрокГодностиЧас
	               |			ТОГДА "";%1 час;;%1 часа;%1 часов;%1 часа""
	               |		ИНАЧЕ """"
	               |	КОНЕЦ КАК ПредставлениеСрокаГодности,
	               |	ПроверкаКачестваТоваров.ХарактеристикаНоменклатуры.СрокГодностиНеограничен КАК СрокГодностиНеограничен,
	               |	ПроверкаКачестваТоваров.МестоОтбораОбразца.Наименование КАК МестоОтбораОбразца,
	               |	ПроверкаКачестваТоваров.ТемператураОбразца,
	               |	ПроверкаКачестваТоваров.ДатаПроизводстваОбразца,
	               |	ПроверкаКачестваТоваров.НомерПротокола,
	               |	ПроверкаКачестваТоваров.ДатаПротокола,
	               |	ПроверкаКачестваТоваров.Заключение,
	               |	ПроверкаКачестваТоваров.ОрганолептическиеПоказатели.(
	               |		Ссылка,
	               |		НомерСтроки,
	               |		Показатель,
	               |		ТребованияПоНД,
	               |		Результат
	               |	),
	               |	ПроверкаКачестваТоваров.ФизикоХимическиеПоказатели.(
	               |		Ссылка,
	               |		НомерСтроки,
	               |		Показатель,
	               |		Показатель.ЕдиницаИзмерения,
	               |		НормативныйДокумент,
	               |		ТребованияПоНД,
	               |		Результат,
	               |		Отклонение
	               |	)
	               |ИЗ
	               |	Документ.ПроверкаКачестваТоваров КАК ПроверкаКачестваТоваров
	               |ГДЕ
	               |	ПроверкаКачестваТоваров.Ссылка = &Ссылка";
	Запрос.Параметры.Вставить("Ссылка", Ссылка);
	Запрос.Параметры.Вставить("СрокГодностиГод", Справочники.ТипыСроковГодности.НайтиПоНаименованию("Год", Истина));
	Запрос.Параметры.Вставить("СрокГодностиМесяц", Справочники.ТипыСроковГодности.НайтиПоНаименованию("Месяц", Истина));
	Запрос.Параметры.Вставить("СрокГодностиСутки", Справочники.ТипыСроковГодности.НайтиПоНаименованию("Сутки", Истина));
	Запрос.Параметры.Вставить("СрокГодностиЧас", Справочники.ТипыСроковГодности.НайтиПоНаименованию("Час", Истина));
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		СрокГодности = "";
		Если Выборка.СрокГодностиНеограничен = Истина Тогда
			СрокГодности = "Не ограничен";
		Иначе
			Если ЗначениеЗаполнено(Выборка.СрокГодности) Тогда
				Если ЗначениеЗаполнено(Выборка.ПредставлениеСрокаГодности) Тогда
					СрокГодности = СтрокаСЧислом(Выборка.ПредставлениеСрокаГодности, Выборка.СрокГодности, ВидЧисловогоЗначения.Количественное, "L=ru");
				Иначе
					СрокГодности = Строка(Выборка.СрокГодности) + " " + Выборка.ТипСрокаГодности;
				КонецЕсли;
			КонецЕсли;
		КонецЕсли;
		
		ОбластьШапка.Параметры.Заполнить(Выборка);
		ОбластьШапка.Параметры.СрокГодности = СрокГодности;
		ОбластьШапка.Параметры.ТемператураОбразца = Строка(Выборка.ТемператураОбразца) + " °C";
		ТабДок.Вывести(ОбластьШапка);
		
		Если Не Выборка.ОрганолептическиеПоказатели.Пустой() Тогда
			ТабДок.Вывести(ОбластьШапкаОрганолептическиеПоказатели);
			ВыборкаСтрок = Выборка.ОрганолептическиеПоказатели.Выбрать();
			Пока ВыборкаСтрок.Следующий() Цикл
				ОбластьСтрокаОрганолептическиеПоказатели.Параметры.Заполнить(ВыборкаСтрок);
				ТабДок.Вывести(ОбластьСтрокаОрганолептическиеПоказатели);
			КонецЦикла;
		КонецЕсли;
		
		ТабДок.Вывести(ОбластьШапкаФизикоХимическиеПоказатели);
		ВыборкаСтрок = Выборка.ФизикоХимическиеПоказатели.Выбрать();
		Пока ВыборкаСтрок.Следующий() Цикл
			ОбластьСтрокаФизикоХимическиеПоказатели.Параметры.Заполнить(ВыборкаСтрок);
			ТабДок.Вывести(ОбластьСтрокаФизикоХимическиеПоказатели);
			
			Если ВыборкаСтрок.Отклонение Тогда
				ТабДок.Область(ТабДок.ВысотаТаблицы, 6).ЦветТекста = Новый Цвет(255, 0, 0);
			КонецЕсли;
		КонецЦикла;

		ОбластьПодвал.Параметры.Заполнить(Выборка);
		ТабДок.Вывести(ОбластьПодвал);
	КонецЦикла;
КонецПроцедуры
